ckuzma/cypress-sensor-hub/PSoC Firmware/EnvironmentSensing.cydsn/Generated_Source/PSoC4/DownMixer_UABH_A_regs.h
#define DownMixer_UABH_A_SW_CA_IN1_ADDR                (DownMixer_UABH_A_halfuab__SW_CA_IN1)
#define DownMixer_UABH_A_SW_CA_IN1_PTR                ((reg32*)DownMixer_UABH_A_SW_CA_IN1_ADDR)
#define DownMixer_UABH_A_SW_CA_IN1_REG                (*(DownMixer_UABH_A_SW_CA_IN1_PTR))

#define DownMixer_UABH_A_SW_CA_TOP_ADDR                (DownMixer_UABH_A_halfuab__SW_CA_TOP)
#define DownMixer_UABH_A_SW_CA_TOP_PTR                ((reg32*)DownMixer_UABH_A_SW_CA_TOP_ADDR)
#define DownMixer_UABH_A_SW_CA_TOP_REG                (*(DownMixer_UABH_A_SW_CA_TOP_PTR))

#define DownMixer_UABH_A_SW_CB_IN0_ADDR                (DownMixer_UABH_A_halfuab__SW_CB_IN0)
#define DownMixer_UABH_A_SW_CB_IN0_PTR                ((reg32*)DownMixer_UABH_A_SW_CB_IN0_ADDR)
#define DownMixer_UABH_A_SW_CB_IN0_REG                (*(DownMixer_UABH_A_SW_CB_IN0_PTR))

#define DownMixer_UABH_A_SW_CB_IN1_ADDR                (DownMixer_UABH_A_halfuab__SW_CB_IN1)
#define DownMixer_UABH_A_SW_CB_IN1_PTR                ((reg32*)DownMixer_UABH_A_SW_CB_IN1_ADDR)
#define DownMixer_UABH_A_SW_CB_IN1_REG                (*(DownMixer_UABH_A_SW_CB_IN1_PTR))

#define DownMixer_UABH_A_SW_CB_TOP_ADDR                (DownMixer_UABH_A_halfuab__SW_CB_TOP)
#define DownMixer_UABH_A_SW_CB_TOP_PTR                ((reg32*)DownMixer_UABH_A_SW_CB_TOP_ADDR)
#define DownMixer_UABH_A_SW_CB_TOP_REG                (*(DownMixer_UABH_A_SW_CB_TOP_PTR))

#define DownMixer_UABH_A_SW_CC_IN0_ADDR                (DownMixer_UABH_A_halfuab__SW_CC_IN0)
#define DownMixer_UABH_A_SW_CC_IN0_PTR                ((reg32*)DownMixer_UABH_A_SW_CC_IN0_ADDR)
#define DownMixer_UABH_A_SW_CC_IN0_REG                (*(DownMixer_UABH_A_SW_CC_IN0_PTR))

#define DownMixer_UABH_A_SW_CC_IN1_ADDR                (DownMixer_UABH_A_halfuab__SW_CC_IN1)
#define DownMixer_UABH_A_SW_CC_IN1_PTR                ((reg32*)DownMixer_UABH_A_SW_CC_IN1_ADDR)
#define DownMixer_UABH_A_SW_CC_IN1_REG                (*(DownMixer_UABH_A_SW_CC_IN1_PTR))

#define DownMixer_UABH_A_SW_CC_TOP_ADDR                (DownMixer_UABH_A_halfuab__SW_CC_TOP)
#define DownMixer_UABH_A_SW_CC_TOP_PTR                ((reg32*)DownMixer_UABH_A_SW_CC_TOP_ADDR)
#define DownMixer_UABH_A_SW_CC_TOP_REG                (*(DownMixer_UABH_A_SW_CC_TOP_PTR))

#define DownMixer_UABH_A_SW_CF_BOT_ADDR                (DownMixer_UABH_A_halfuab__SW_CF_BOT)
#define DownMixer_UABH_A_SW_CF_BOT_PTR                ((reg32*)DownMixer_UABH_A_SW_CF_BOT_ADDR)
#define DownMixer_UABH_A_SW_CF_BOT_REG                (*(DownMixer_UABH_A_SW_CF_BOT_PTR))

#define DownMixer_UABH_A_SW_OTHER_ADDR                 (DownMixer_UABH_A_halfuab__SW_OTHER)
#define DownMixer_UABH_A_SW_OTHER_PTR                 ((reg32*)DownMixer_UABH_A_SW_OTHER_ADDR)
#define DownMixer_UABH_A_SW_OTHER_REG                 (*(DownMixer_UABH_A_SW_OTHER_PTR))

#define DownMixer_UABH_A_SW_BOOST_CTRL_ADDR            (DownMixer_UABH_A_halfuab__SW_BOOST_CTRL)
#define DownMixer_UABH_A_SW_BOOST_CTRL_PTR            ((reg32*)DownMixer_UABH_A_SW_BOOST_CTRL_ADDR)
#define DownMixer_UABH_A_SW_BOOST_CTRL_REG            (*(DownMixer_UABH_A_SW_BOOST_CTRL_PTR))

#define DownMixer_UABH_A_SRAM_CTRL_ADDR                (DownMixer_UABH_A_halfuab__SRAM_CTRL)
#define DownMixer_UABH_A_SRAM_CTRL_PTR                ((reg32*)DownMixer_UABH_A_SRAM_CTRL_ADDR)
#define DownMixer_UABH_A_SRAM_CTRL_REG                (*(DownMixer_UABH_A_SRAM_CTRL_PTR))

#define DownMixer_UABH_A_STAT_ADDR                     (DownMixer_UABH_A_halfuab__STAT)
#define DownMixer_UABH_A_STAT_PTR                     ((reg32*)DownMixer_UABH_A_STAT_ADDR)
#define DownMixer_UABH_A_STAT_REG                     (*(DownMixer_UABH_A_STAT_PTR))

#define DownMixer_UABH_A_SRAM0_ADDR                    (DownMixer_UABH_A_halfuab__SRAM0)
#define DownMixer_UABH_A_SRAM0_PTR                    ((reg32*)DownMixer_UABH_A_SRAM0_ADDR)
#define DownMixer_UABH_A_SRAM0_REG                    (*(DownMixer_UABH_A_SRAM0_PTR))

#define DownMixer_UABH_A_SRAM1_ADDR                    (DownMixer_UABH_A_halfuab__SRAM1)
#define DownMixer_UABH_A_SRAM1_PTR                    ((reg32*)DownMixer_UABH_A_SRAM1_ADDR)
#define DownMixer_UABH_A_SRAM1_REG                    (*(DownMixer_UABH_A_SRAM1_PTR))

#define DownMixer_UABH_A_SRAM2_ADDR                    (DownMixer_UABH_A_halfuab__SRAM2)
#define DownMixer_UABH_A_SRAM2_PTR                    ((reg32*)DownMixer_UABH_A_SRAM2_ADDR)
#define DownMixer_UABH_A_SRAM2_REG                    (*(DownMixer_UABH_A_SRAM2_PTR))

#define DownMixer_UABH_A_SRAM3_ADDR                    (DownMixer_UABH_A_halfuab__SRAM3)
#define DownMixer_UABH_A_SRAM3_PTR                    ((reg32*)DownMixer_UABH_A_SRAM3_ADDR)
#define DownMixer_UABH_A_SRAM3_REG                    (*(DownMixer_UABH_A_SRAM3_PTR))

#define DownMixer_UABH_A_SRAM4_ADDR                    (DownMixer_UABH_A_halfuab__SRAM4)
#define DownMixer_UABH_A_SRAM4_PTR                    ((reg32*)DownMixer_UABH_A_SRAM4_ADDR)
#define DownMixer_UABH_A_SRAM4_REG                    (*(DownMixer_UABH_A_SRAM4_PTR))

#define DownMixer_UABH_A_SRAM5_ADDR                    (DownMixer_UABH_A_halfuab__SRAM5)
#define DownMixer_UABH_A_SRAM5_PTR                    ((reg32*)DownMixer_UABH_A_SRAM5_ADDR)
#define DownMixer_UABH_A_SRAM5_REG                    (*(DownMixer_UABH_A_SRAM5_PTR))

#define DownMixer_UABH_A_SRAM6_ADDR                    (DownMixer_UABH_A_halfuab__SRAM6)
#define DownMixer_UABH_A_SRAM6_PTR                    ((reg32*)DownMixer_UABH_A_SRAM6_ADDR)
#define DownMixer_UABH_A_SRAM6_REG                    (*(DownMixer_UABH_A_SRAM6_PTR))

#define DownMixer_UABH_A_SRAM7_ADDR                    (DownMixer_UABH_A_halfuab__SRAM7)
#define DownMixer_UABH_A_SRAM7_PTR                    ((reg32*)DownMixer_UABH_A_SRAM7_ADDR)
#define DownMixer_UABH_A_SRAM7_REG                    (*(DownMixer_UABH_A_SRAM7_PTR))

#define DownMixer_UABH_A_SRAM8_ADDR                    (DownMixer_UABH_A_halfuab__SRAM8)
#define DownMixer_UABH_A_SRAM8_PTR                    ((reg32*)DownMixer_UABH_A_SRAM8_ADDR)
#define DownMixer_UABH_A_SRAM8_REG                    (*(DownMixer_UABH_A_SRAM8_PTR))

