ckuzma/cypress-sensor-hub/PSoC Firmware/EnvironmentSensing.cydsn/Generated_Source/PSoC4/DownMixer_UABH_A_regs.h
#define DownMixer_UABH_A_SRAM9_ADDR                    (DownMixer_UABH_A_halfuab__SRAM9)
#define DownMixer_UABH_A_SRAM9_PTR                    ((reg32*)DownMixer_UABH_A_SRAM9_ADDR)
#define DownMixer_UABH_A_SRAM9_REG                    (*(DownMixer_UABH_A_SRAM9_PTR))

#define DownMixer_UABH_A_SRAM10_ADDR                   (DownMixer_UABH_A_halfuab__SRAM10)
#define DownMixer_UABH_A_SRAM10_PTR                   ((reg32*)DownMixer_UABH_A_SRAM10_ADDR)
#define DownMixer_UABH_A_SRAM10_REG                   (*(DownMixer_UABH_A_SRAM10_PTR))

#define DownMixer_UABH_A_SRAM11_ADDR                   (DownMixer_UABH_A_halfuab__SRAM11)
#define DownMixer_UABH_A_SRAM11_PTR                   ((reg32*)DownMixer_UABH_A_SRAM11_ADDR)
#define DownMixer_UABH_A_SRAM11_REG                   (*(DownMixer_UABH_A_SRAM11_PTR))

#define DownMixer_UABH_A_SRAM12_ADDR                   (DownMixer_UABH_A_halfuab__SRAM12)
#define DownMixer_UABH_A_SRAM12_PTR                   ((reg32*)DownMixer_UABH_A_SRAM12_ADDR)
#define DownMixer_UABH_A_SRAM12_REG                   (*(DownMixer_UABH_A_SRAM12_PTR))

#define DownMixer_UABH_A_SRAM13_ADDR                   (DownMixer_UABH_A_halfuab__SRAM13)
#define DownMixer_UABH_A_SRAM13_PTR                   ((reg32*)DownMixer_UABH_A_SRAM13_ADDR)
#define DownMixer_UABH_A_SRAM13_REG                   (*(DownMixer_UABH_A_SRAM13_PTR))

#define DownMixer_UABH_A_SRAM14_ADDR                   (DownMixer_UABH_A_halfuab__SRAM14)
#define DownMixer_UABH_A_SRAM14_PTR                   ((reg32*)DownMixer_UABH_A_SRAM14_ADDR)
#define DownMixer_UABH_A_SRAM14_REG                   (*(DownMixer_UABH_A_SRAM14_PTR))

#define DownMixer_UABH_A_SRAM15_ADDR                   (DownMixer_UABH_A_halfuab__SRAM15)
#define DownMixer_UABH_A_SRAM15_PTR                   ((reg32*)DownMixer_UABH_A_SRAM15_ADDR)
#define DownMixer_UABH_A_SRAM15_REG                   (*(DownMixer_UABH_A_SRAM15_PTR))

#define DownMixer_UABH_A_SW_CC1_IN0_ADDR               (DownMixer_UABH_A_halfuab__SW_CC1_IN0)
#define DownMixer_UABH_A_SW_CC1_IN0_PTR               ((reg32*)DownMixer_UABH_A_SW_CC1_IN0_ADDR)
#define DownMixer_UABH_A_SW_CC1_IN0_REG               (*(DownMixer_UABH_A_SW_CC1_IN0_PTR))

#define DownMixer_UABH_A_SW_CC1_IN1_ADDR               (DownMixer_UABH_A_halfuab__SW_CC1_IN1)
#define DownMixer_UABH_A_SW_CC1_IN1_PTR               ((reg32*)DownMixer_UABH_A_SW_CC1_IN1_ADDR)
#define DownMixer_UABH_A_SW_CC1_IN1_REG               (*(DownMixer_UABH_A_SW_CC1_IN1_PTR))

#define DownMixer_UABH_A_SW_CC1_TOP_ADDR               (DownMixer_UABH_A_halfuab__SW_CC1_TOP)
#define DownMixer_UABH_A_SW_CC1_TOP_PTR               ((reg32*)DownMixer_UABH_A_SW_CC1_TOP_ADDR)
#define DownMixer_UABH_A_SW_CC1_TOP_REG               (*(DownMixer_UABH_A_SW_CC1_TOP_PTR))

#define DownMixer_UABH_A_CAP_TRIM_ADDR                 (DownMixer_UABH_A_halfuab__CAP_TRIM)
#define DownMixer_UABH_A_CAP_TRIM_PTR                 ((reg32*)DownMixer_UABH_A_CAP_TRIM_ADDR)
#define DownMixer_UABH_A_CAP_TRIM_REG                 (*(DownMixer_UABH_A_CAP_TRIM_PTR))

#define DownMixer_UABH_A_OA_TRIM_ADDR                  (DownMixer_UABH_A_halfuab__OA_TRIM)
#define DownMixer_UABH_A_OA_TRIM_PTR                  ((reg32*)DownMixer_UABH_A_OA_TRIM_ADDR)
#define DownMixer_UABH_A_OA_TRIM_REG                  (*(DownMixer_UABH_A_OA_TRIM_PTR))

/* Starting address for half UAB region */
#define DownMixer_UABH_A_BASE_ADDR                    (DownMixer_UABH_A_halfuab__OA_CTRL)
    



/*Register Field Definitions*/

    
/*UAB_CTRL*/
#define DownMixer_UABH_A_ENABLED_SHIFT                CyUAB_ENABLED_SHIFT
#define DownMixer_UABH_A_ENABLED_MASK                 (1UL<<DownMixer_UABH_A_ENABLED_SHIFT)


/*INTR*/
#if DownMixer_UABH_A_ISODD==1
    #define DownMixer_UABH_A_INTR_COMP_SHIFT CyUAB_INTR_COMP1_SHIFT
#else
    #define DownMixer_UABH_A_INTR_COMP_SHIFT CyUAB_INTR_COMP0_SHIFT
#endif
#define DownMixer_UABH_A_INTR_COMP_MASK               (1UL<<DownMixer_UABH_A_INTR_COMP_SHIFT)

#if DownMixer_UABH_A_ISODD==1
   #define DownMixer_UABH_A_INTR_VDAC_EMPTY_SHIFT CyUAB_INTR_VDAC1_EMPTY_SHIFT
#else
   #define DownMixer_UABH_A_INTR_VDAC_EMPTY_SHIFT CyUAB_INTR_VDAC0_EMPTY_SHIFT
#endif
#define DownMixer_UABH_A_INTR_VDAC_EMPTY_MASK         (1UL<<DownMixer_UABH_A_INTR_VDAC_EMPTY_SHIFT)


/*INTR_SET*/
#define DownMixer_UABH_A_INTR_COMP_SET_SHIFT          DownMixer_UABH_A_INTR_COMP_SHIFT
#define DownMixer_UABH_A_INTR_COMP_SET_MASK           (1UL<<DownMixer_UABH_A_INTR_COMP_SET_SHIFT)

#define DownMixer_UABH_A_INTR_VDAC_EMPTY_SET_SHIFT    DownMixer_UABH_A_INTR_VDAC_EMPTY_SHIFT
#define DownMixer_UABH_A_INTR_VDAC_EMPTY_SET_MASK     (1UL<<DownMixer_UABH_A_INTR_VDAC_EMPTY_SET_SHIFT)


/*INTR_MASK*/
#define DownMixer_UABH_A_INTR_COMP_MASK_SHIFT         DownMixer_UABH_A_INTR_COMP_SHIFT
#define DownMixer_UABH_A_INTR_COMP_MASK_MASK          (1UL<<DownMixer_UABH_A_INTR_COMP_MASK_SHIFT)

#define DownMixer_UABH_A_INTR_VDAC_EMPTY_MASK_SHIFT   DownMixer_UABH_A_INTR_VDAC_EMPTY_SHIFT
#define DownMixer_UABH_A_INTR_VDAC_EMPTY_MASK_MASK    (1UL<<DownMixer_UABH_A_INTR_VDAC_EMPTY_MASK_SHIFT)


/*INTR_MASKED*/
#define DownMixer_UABH_A_INTR_COMP_MASKED_SHIFT       DownMixer_UABH_A_INTR_COMP_SHIFT
#define DownMixer_UABH_A_INTR_COMP_MASKED_MASK        (1UL<<DownMixer_UABH_A_INTR_COMP_MASKED_SHIFT)

#define DownMixer_UABH_A_INTR_VDAC_EMPTY_MASKED_SHIFT DownMixer_UABH_A_INTR_VDAC_EMPTY_SHIFT
#define DownMixer_UABH_A_INTR_VDAC_EMPTY_MASKED_MASK  (1UL<<DownMixer_UABH_A_INTR_VDAC_EMPTY_MASKED_SHIFT)


/*OA_CTRL*/
#define DownMixer_UABH_A_OA_PWR_SHIFT                 CyUAB_OA_PWR_SHIFT
#define DownMixer_UABH_A_OA_PWR_MASK                  (0x7UL<<DownMixer_UABH_A_OA_PWR_SHIFT)

#define DownMixer_UABH_A_CMP_PWR_SHIFT                CyUAB_CMP_PWR_SHIFT
#define DownMixer_UABH_A_CMP_PWR_MASK                 (0x7UL<<DownMixer_UABH_A_CMP_PWR_SHIFT)

#define DownMixer_UABH_A_CMP_EDGE_SHIFT               CyUAB_CMP_EDGE_SHIFT
#define DownMixer_UABH_A_CMP_EDGE_MASK                (0x3UL<<DownMixer_UABH_A_CMP_EDGE_SHIFT)
#define DownMixer_UABH_A_CMP_EDGE_DISABLE             (0UL)
#define DownMixer_UABH_A_CMP_EDGE_RISING              (1UL)
#define DownMixer_UABH_A_CMP_EDGE_FALLING             (2UL)
#define DownMixer_UABH_A_CMP_EDGE_BOTH                (3UL)

#define DownMixer_UABH_A_CMP_DSI_LEVEL_SHIFT          CyUAB_CMP_DSI_LEVEL_SHIFT
#define DownMixer_UABH_A_CMP_DSI_LEVEL_MASK           (1UL<<DownMixer_UABH_A_CMP_DSI_LEVEL_SHIFT)

#define DownMixer_UABH_A_CTRL_SPARE_SHIFT             CyUAB_CTRL_SPARE_SHIFT
#define DownMixer_UABH_A_CTRL_SPARE_MASK              (1UL<<DownMixer_UABH_A_CTRL_SPARE_SHIFT)

#define DownMixer_UABH_A_REF_PWR_SHIFT                CyUAB_REF_PWR_SHIFT
#define DownMixer_UABH_A_REF_PWR_MASK                 (0x7UL<<DownMixer_UABH_A_REF_PWR_SHIFT)

#define DownMixer_UABH_A_REF_PTS_SHIFT                CyUAB_REF_PTS_SHIFT
#define DownMixer_UABH_A_REF_PTS_MASK                 (1UL<<DownMixer_UABH_A_REF_PTS_SHIFT)

#define DownMixer_UABH_A_AGND_PWR_SHIFT               CyUAB_AGND_PWR_SHIFT
#define DownMixer_UABH_A_AGND_PWR_MASK                (0x7UL<<DownMixer_UABH_A_AGND_PWR_SHIFT)

#define DownMixer_UABH_A_AGND_PTS_SHIFT               CyUAB_AGND_PTS_SHIFT
#define DownMixer_UABH_A_AGND_PTS_MASK                (1UL<<DownMixer_UABH_A_AGND_PTS_SHIFT)

#define DownMixer_UABH_A_AGND_TIED_SHIFT              CyUAB_AGND_TIED_SHIFT
#define DownMixer_UABH_A_AGND_TIED_MASK               (1UL<<DownMixer_UABH_A_AGND_TIED_SHIFT)

#define DownMixer_UABH_A_REF_TIED_SHIFT               CyUAB_REF_TIED_SHIFT
#define DownMixer_UABH_A_REF_TIED_MASK                (1UL<<DownMixer_UABH_A_REF_TIED_SHIFT)    
    
#define DownMixer_UABH_A_UAB_PWR_SHIFT                CyUAB_UAB_PWR_SHIFT
#define DownMixer_UABH_A_UAB_PWR_MASK                 (0x3UL<<DownMixer_UABH_A_UAB_PWR_SHIFT)
#define DownMixer_UABH_A_UAB_PWR_NORMAL               (0UL)
#define DownMixer_UABH_A_UAB_PWR_ULTRA_LOW            (1UL)
#define DownMixer_UABH_A_UAB_PWR_ULTRA_HIGH           (2UL)
#define DownMixer_UABH_A_UAB_PWR_Reserved             (3UL)


/*CAP_CTRL*/
#define DownMixer_UABH_A_CB_GND_SHIFT                 CyUAB_CB_GND_SHIFT
#define DownMixer_UABH_A_CB_GND_MASK                  (1UL<<DownMixer_UABH_A_CB_GND_SHIFT)

#define DownMixer_UABH_A_CC_GND_SHIFT                 CyUAB_CC_GND_SHIFT
#define DownMixer_UABH_A_CC_GND_MASK                  (1UL<<DownMixer_UABH_A_CC_GND_SHIFT)

#define DownMixer_UABH_A_FRC_SIGN_BIT_SHIFT           CyUAB_FRC_SIGN_BIT_SHIFT
#define DownMixer_UABH_A_FRC_SIGN_BIT_MASK            (1UL<<CyUAB_FRC_SIGN_BIT_SHIFT)

#define DownMixer_UABH_A_DAC_MODE_EN_SHIFT            CyUAB_DAC_MODE_EN_SHIFT
#define DownMixer_UABH_A_DAC_MODE_EN_MASK             (1UL<<DownMixer_UABH_A_DAC_MODE_EN_SHIFT)

#define DownMixer_UABH_A_DAC_MODE_SHIFT               CyUAB_DAC_MODE_SHIFT
#define DownMixer_UABH_A_DAC_MODE_MASK                (0x3UL<<DownMixer_UABH_A_DAC_MODE_SHIFT)
#define DownMixer_UABH_A_DAC_MODE_UNSIGNED12          (0UL)
#define DownMixer_UABH_A_DAC_MODE_VIRT_SIGNED12       (1UL)
#define DownMixer_UABH_A_DAC_MODE_SIGNED13            (2UL)
#define DownMixer_UABH_A_DAC_MODE_RESERVED            (3UL)


