ckuzma/cypress-sensor-hub/PSoC Firmware/EnvironmentSensing.cydsn/Generated_Source/PSoC4/DownMixer_UABH_A_regs.h
#define DownMixer_UABH_A_SW_AR_MODBIT_SHIFT           CyUAB_SW_AR_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_AR_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_AR_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_AG_MODBIT_SHIFT           CyUAB_SW_AG_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_AG_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_AG_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_AV_MODBIT_SHIFT           CyUAB_SW_AV_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_AV_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_AV_MODBIT_SHIFT)


/*SW_CA_TOP*/
#define DownMixer_UABH_A_SW_RA_MODBIT_SHIFT           CyUAB_SW_RA_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_RA_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_RA_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_GA_MODBIT_SHIFT           CyUAB_SW_GA_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_GA_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_GA_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_VA_MODBIT_SHIFT           CyUAB_SW_VA_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_VA_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_VA_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_SA_SHIFT                  CyUAB_SW_SA_SHIFT
#define DownMixer_UABH_A_SW_SA_MASK                   (0xfUL<<DownMixer_UABH_A_SW_SA_SHIFT)


/*SW_CB_IN0*/
#define DownMixer_UABH_A_SW_B0_MODBIT_SHIFT           CyUAB_SW_B0_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_B0_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_B0_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_B1_MODBIT_SHIFT           CyUAB_SW_B1_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_B1_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_B1_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_B2_MODBIT_SHIFT           CyUAB_SW_B2_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_B2_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_B2_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_B3_MODBIT_SHIFT           CyUAB_SW_B3_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_B3_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_B3_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_BP_SHIFT                  CyUAB_SW_BP_SHIFT
#define DownMixer_UABH_A_SW_BP_MASK                   (0xfUL<<DownMixer_UABH_A_SW_BP_SHIFT)

#define DownMixer_UABH_A_SW_BQ_SHIFT                  CyUAB_SW_BQ_SHIFT
#define DownMixer_UABH_A_SW_BQ_MASK                   (0xfUL<<DownMixer_UABH_A_SW_BQ_SHIFT)


/*SW_CB_IN1*/
#define DownMixer_UABH_A_SW_BB_SHIFT                  CyUAB_SW_BB_SHIFT
#define DownMixer_UABH_A_SW_BB_MASK                   (0xfUL<<DownMixer_UABH_A_SW_BB_SHIFT)

#define DownMixer_UABH_A_SW_BR_MODBIT_SHIFT           CyUAB_SW_BR_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_BR_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_BR_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_BG_MODBIT_SHIFT           CyUAB_SW_BG_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_BG_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_BG_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_BV_MODBIT_SHIFT           CyUAB_SW_BV_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_BV_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_BV_MODBIT_SHIFT)


/*SW_CB_TOP*/
#define DownMixer_UABH_A_SW_RB_MODBIT_SHIFT           CyUAB_SW_RB_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_RB_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_RB_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_GB_MODBIT_SHIFT           CyUAB_SW_GB_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_GB_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_GB_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_VB_MODBIT_SHIFT           CyUAB_SW_VB_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_VB_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_VB_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_TB_SHIFT                  CyUAB_SW_TB_SHIFT
#define DownMixer_UABH_A_SW_TB_MASK                   (0xfUL<<DownMixer_UABH_A_SW_TB_SHIFT)

#define DownMixer_UABH_A_SW_SB_SHIFT                  CyUAB_SW_SB_SHIFT
#define DownMixer_UABH_A_SW_SB_MASK                   (0xfUL<<DownMixer_UABH_A_SW_SB_SHIFT)


/*SW_CC_IN0*/
#define DownMixer_UABH_A_SW_C0_MODBIT_SHIFT           CyUAB_SW_C0_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_C0_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_C0_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_C1_MODBIT_SHIFT           CyUAB_SW_C1_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_C1_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_C1_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_C2_MODBIT_SHIFT           CyUAB_SW_C2_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_C2_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_C2_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_C3_MODBIT_SHIFT           CyUAB_SW_C3_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_C3_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_C3_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_CP_SHIFT                  CyUAB_SW_CP_SHIFT
#define DownMixer_UABH_A_SW_CP_MASK                   (0xfUL<<DownMixer_UABH_A_SW_CP_SHIFT)

#define DownMixer_UABH_A_SW_CQ_SHIFT                  CyUAB_SW_CQ_SHIFT
#define DownMixer_UABH_A_SW_CQ_MASK                   (0xfUL<<DownMixer_UABH_A_SW_CQ_SHIFT)


/*SW_CC_IN1*/
#define DownMixer_UABH_A_SW_CC_SHIFT                  CyUAB_SW_CC_SHIFT
#define DownMixer_UABH_A_SW_CC_MASK                   (0xfUL<<DownMixer_UABH_A_SW_CC_SHIFT)

#define DownMixer_UABH_A_SW_CR_MODBIT_SHIFT           CyUAB_SW_CR_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_CR_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_CR_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_CG_MODBIT_SHIFT           CyUAB_SW_CG_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_CG_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_CG_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_CV_MODBIT_SHIFT           CyUAB_SW_CV_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_CV_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_CV_MODBIT_SHIFT)


/*SW_CC_TOP*/
#define DownMixer_UABH_A_SW_RC_MODBIT_SHIFT           CyUAB_SW_RC_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_RC_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_RC_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_GC_MODBIT_SHIFT           CyUAB_SW_GC_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_GC_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_GC_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_VC_MODBIT_SHIFT           CyUAB_SW_VC_MODBIT_SHIFT
#define DownMixer_UABH_A_SW_VC_MODBIT_MASK            (0xfUL<<DownMixer_UABH_A_SW_VC_MODBIT_SHIFT)

#define DownMixer_UABH_A_SW_TC_SHIFT                  CyUAB_SW_TC_SHIFT
#define DownMixer_UABH_A_SW_TC_MASK                   (0xfUL<<DownMixer_UABH_A_SW_TC_SHIFT)

#define DownMixer_UABH_A_SW_SC_SHIFT                  CyUAB_SW_SC_SHIFT
#define DownMixer_UABH_A_SW_SC_MASK                   (0xfUL<<DownMixer_UABH_A_SW_SC_SHIFT)

#define DownMixer_UABH_A_SW_ZC_SHIFT                  CyUAB_SW_ZC_SHIFT
#define DownMixer_UABH_A_SW_ZC_MASK                   (0xfUL<<DownMixer_UABH_A_SW_ZC_SHIFT)


